/************************************************************************
 FileName: 5_PlaceaVolume
 Author: 刘铭
 Describe: 放置几何体
 Create: Dec 30 2020, 19:24
 Last Modify: 
 Modifications: 0
************************************************************************/

/************************************************************************
    如果已经创建了一个逻辑体，可以将这个逻辑体放置到另一个已经存在的几何体中。然后决定这个几何体的中心放置到另一个几何体什么位置以及设置角度。
    一旦这些都确定了，那么久可以创建一个物理体了。物理体是一个已经放置的几何体实例，包涵几何体的所有属性。
************************************************************************/
