/******************************************************************
FileName: 7_CoordinateSystemsAndRotations
Author: 刘铭
Describes: Geant4中物理体坐标系与旋转
Create: Dec 31 2020, 16:25
Last Modify: 
Modification: 0
 *****************************************************************/

/*****************************************************************
   在Geant4中，与一个已经放置的物理体相关的旋转矩阵描述的是这个几何体的坐标系相对于母体坐标系的旋转变换。
    一个旋转矩阵的建立通常与CLHELP(什么意思？)一样，通过实例化一个单位矩阵，然后对这个单位矩阵进行旋转变换。
 ****************************************************************/
